## Python MySQL Database Access
http://www.tutorialspoint.com/python/python_database_access.htm

MySQLdb adalah sebuah interface untuk menghubungkan server database MySQL dari Python. Menerapkan Python Database API v2.0.
Sebelum menghubungkan MySQL database, pastikan bahwa MySQLdb dan mysql-python-connector telah terinstal pada komputer. Pastikan juga bahwa database TESTDB telah dibuat, dan telah terdapat tabel EMPLOYEE dalam database TESTDB tersebut.

In [4]:
import MySQLdb

In [7]:
# Membuka koneksi ke database
# Open database connection
# Make sure XAMPP is started

db=MySQLdb.connect("localhost","root","","TESTDB")

In [8]:
# Menyiapkan sebuah object cursor menggunakan method cursor()
# Prepare a cursor object using cursor() method

cursor = db.cursor()

In [9]:
# mengeksekusi SQL query menggunakan method execute
# execute SQL query using execute() method

cursor.execute("select version()")

1L

In [10]:
# Mengambil sebuah single row menggunakan method fetchone()
# Fetch a single row using fetchone() method.

data= cursor.fetchone()

In [11]:
print "Database vesion: %s"%data

Database vesion: 10.1.25-MariaDB

### Creating Database Table
Create table EMPLOYEE in MySQLdb databse

In [12]:
# Menghapus table jika sudah ada
# Drop table if it already exist using execute() method.

cursor.execute("drop table if exists employee")

# Membuat tabel employee
# Create table as per requirement

sql="""create table employee(
first_name char(20) not null,
last_name char(20),
age int,
sex char(1),
income float )"""
cursor.execute(sql)

0L

### INSERT Operation
This is operation to add the records in database table

In [13]:
# Memasukkan sebuah record ke dalam database
# INSERT a record into the database
sql="""insert into employee(first_name, last_name, age, sex, income)
values('Mac', 'Mohan',20, 'M',2000)"""
try:
    # Mengeksekusi  perintah SQL
    # Execute the SQL command
    cursor.execute(sql)
    # Commit perubahan dalam database
    # Commit changes in the database
    db.commit()
except:
    # Rollback jika terjadi Error
    # Rollback in case there is any error
    db.rollback()

    # disconnect dari server
    # disconnect from server
db.close

In [14]:
sql="""insert into employee(first_name, last_name, age, sex, income)
values('Mic','Mihan',20,'F',1900)"""
try:
    cursor.execute(sql)
    db.commit()
except:
    db.rollback()
db.close

#####  Create SQL queries dynamically

In [15]:
import MySQLdb

db = MySQLdb.connect("localhost","root","","TESTDB")

cursor = db.cursor

sql="insert into employee(first_name, last_name, age, sex, income)\
values('%s','%s','%d','%c','%d')"%\
('Abdul','Latief',25,'M',1000)
('Maria','Idol',23,'F',2300)
try:
    cursor.execute(sql)
    db.commit
except:
    db.rollback()
    
db.close

## READ Operation
To fetch some useful information from the database. <br>
<b> Fetchone </b> : fetch the next row of a query result set. A result set is an object that isreturned when a cursor object is used to query a table. <br>
<b> Fetchall </b> : fetch all the rows in a result set. If some rows have already been extracted from the result set, then it retrieves the remaining rows from the result set.<br>
<b> Rowcount </b> : read-only attribute and returns the number of rows that were affected by an execute method.

All records from Employee table having salary more than 2000

In [32]:
import MySQLdb

db = MySQLdb.connect("localhost","root","","TESTDB")

cursor = db.cursor()

sql = "select * from employee where income >'%d'" % (1000)

try:
    cursor.execute(sql)
    results = cursor.fetchall()
    for row in results:
        fname = row[0]
        lname = row[1]
        age = row[2]
        sex = row[3]
        income = row[4]
    print "fname=%s, lname=%s, age=%d, sex=%s, income=%d"%\
        (fname, lname, age, sex, income)
except:
    print "Error: unable to fetch data"
    
db.close()

fname=Mic, lname=Mihan, age=20, sex=F, income=1900

## UPDATE Operation
to update one or more records, which are already available in the database.

Update Age every year where sex as 'M'

In [33]:
import MySQLdb

db=MySQLdb.connect("localhost","root","","TESTDB")

cursor=db.cursor()

sql = " update employee set age = age + 1 where sex='%c'"%('M')

try:
    cursor.execute(sql)
    db.commit()
except:
    db.rollback()
    
db.close()

## DELETE Operation
To delete records from database

Delete all records from employee where age is more than 20

In [35]:
import MySQLdb

db=MySQLdb.connect("localhost","root","","TESTDB")

cursor=db.cursor()

sql=" delete from employee where age > '%d'"%(22)

try:
    cursor.execute(sql)
    db.commit()
except:
    db.rollback()
    
db.close()